const victimList = [
  {
    name: "דינה קפשיטר",
    from: "דימונה"
  },
  {
    name: "יבגני קפשיטר",
    from: "דימונה"
  },
  {
    name: "איתן קפשיטר",
    from: "דימונה",
    age: 5
  },
  {
    name: "אלין קפשיטר",
    from: "דימונה",
    age: 8
  },
  {
    name: "אבשלום (אבשל) הרן",
    from: "בארי"
  },
  {
    name: "מירה שטהל",
    from: "כפר עזה"
  },
  {
    name: "אבי חסדאי",
    description: "נרצח בחוף זיקים"
  },
  {
    name: "סלימאן אבו מרי",
    from: "משגב שלום",
    age: 37
  },
  {
    name: "רס״ם (מיל') טל אילון",
    from: "כפר עזה",
    position: "חבר כיתת הכוננות ביישוב",
    age: 46
  },
  {
    name: "רס״מ יוליה ווקסר",
    position: "ראש לשכת אגף מבצעים מחוז דרום"
  },
  {
    name: "סעיד (דוד) משה",
    from: "ניר עוז"
  },
  {
    name: "קרול סימן טוב",
    from: "ניר עוז"
  },
  {
    name: "עומר סימן טוב",
    from: "ניר עוז",
    age: 4
  },
  {
    name: "ארבל סימן טוב",
    from: "ניר עוז",
    age: 6
  },
  {
    name: "שחר סימן טוב",
    from: "ניר עוז",
    age: 6
  },
  {
    name: "תמר קדם סימן טוב",
    from: "ניר עוז",
    age: 35
  },
  {
    name: "יונתן (ג'וני) סימן טוב",
    from: "ניר עוז"
  },
  {
    name: "סיון שהרבני",
    from: "רמת גן",
    description: "נרצחה במסיבה ברעים",
    age: 21
  },
  {
    name: "תכלת זוהר",
    from: "נחל עוז",
    age: 18
  },
  {
    name: "קשת זוהר",
    from: "נחל עוז",
    age: 20
  },
  {
    name: "יסמין זוהר",
    from: "נחל עוז",
    age: 49
  },
  {
    name: "יניב זוהר",
    from: "נחל עוז",
    description: "צלם \"ישראל היום\"",
    age: 54
  },
  {
    name: "עמית להב",
    from: "ראשון לציון",
    description: "נרצחה במסיבה ברעים",
    age: 23
  },
  {
    name: "נטע אפשטיין",
    from: "כפר עזה",
    age: 22
  },
  {
    name: "אבלום (אלברט) מילס",
    from: "בארי"
  },
  {
    name: "איגור לוסב",
    from: "בארי"
  },
  {
    name: "דוד קרול",
    from: "בארי"
  },
  {
    name: "דור רידר",
    from: "בארי"
  },
  {
    name: "סילביה אוחיון",
    from: "בארי"
  },
  {
    name: "יובל בר",
    from: "בארי"
  },
  {
    name: "מעיין בר",
    from: "בארי"
  },
  {
    name: "מרסל פרייליך",
    from: "בארי"
  },
  {
    name: "רפי סבירסקי",
    from: "בארי"
  },
  {
    name: "אורית סלע סבירסקי",
    from: "בארי"
  },
  {
    name: "רפי מורדו",
    from: "בארי"
  },
  {
    name: "פסי כהן",
    from: "בארי"
  },
  {
    name: "יוסי אפטלון",
    from: "בארי"
  },
  {
    name: "תמי סוכמן",
    from: "בארי"
  },
  {
    name: "ליאן שרעבי",
    from: "בארי"
  },
  {
    name: "מזי בכר",
    from: "בארי"
  },
  {
    name: "אביעד הלוי",
    from: "גן הדרום",
    description: "נרצח במסיבה ברעים",
    age: 29
  },
  {
    name: "צור סעידי",
    from: "גן הדרום",
    description: "נרצח במסיבה ברעים",
    age: 29
  },
  {
    name: "עמרי רם",
    from: "עשרת",
    description: "נרצח במסיבה ברעים",
    age: 29
  },
  {
    name: "מרסדס עמר",
    from: "קריית עקרון",
    description: "נרצחה במסיבה בסמוך לרעים",
    age: 33
  },
  {
    name: "משה בן פורת",
    from: "טבריה",
    description: "נרצח באופקים"
  },
  {
    name: "נעם ליאל אפרים",
    from: "חד-נס",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "לאוניד לוזובסקי",
    from: "שדרות"
  },
  {
    name: "נעמי דגני",
    from: "כפר עזה"
  },
  {
    name: "אליהו רייכנשטיין",
    from: "כפר עזה"
  },
  {
    name: "נאג'י עבדוש",
    from: "קרית עקרון",
    description: "נרצח במסיבה ברעים",
    age: 35
  },
  {
    name: "גל עבדוש",
    from: "קרית עקרון",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "יועד פאר",
    from: "ירושלים",
    description: "נרצח במסיבה ברעים",
    age: 21
  },
  {
    name: "יצחק לוי",
    from: "ירושלים",
    description: "נרצח במסיבה ברעים",
    age: 27
  },
  {
    name: "שמואל (שמוליק) וייס",
    from: "בארי"
  },
  {
    name: "אילן משה יעקב",
    from: "תל אביב",
    description: "נרצח במסיבה ברעים",
    age: 29
  },
  {
    name: "עמית מגנזי",
    from: "נס ציונה",
    description: "נרצח במסיבה ברעים",
    age: 23
  },
  {
    name: "דורון בולדס",
    from: "גן שומרון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "קשת קסרוטי כלפה",
    from: "סמר",
    description: "נרצח במסיבה ברעים",
    age: 22
  },
  {
    name: "דוד קצ'קו קציר",
    from: "כפר עזה"
  },
  {
    name: "יעקובי ינון",
    from: "נתיב העשרה",
    age: 78
  },
  {
    name: "בלהה ינון",
    from: "נתיב העשרה",
    age: 75
  },
  {
    name: "נעם שלום",
    from: "חריש",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "מתן (קידו) אלמלם",
    from: "דימונה",
    description: "תיקלט במסיבה ברעים",
    age: 42
  },
  {
    name: "בר תומר",
    from: "עין שמר",
    description: "נרצחה במסיבה ברעים",
    age: 25
  },
  {
    name: "אביה גנוט",
    from: "צופים",
    description: "נרצחה במסיבה ברעים",
    age: 22
  },
  {
    name: "זיו חג'בי",
    from: "גבים",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "תפארת לפידות",
    from: "חריש",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "יורם בר סיני",
    from: "בארי"
  },
  {
    name: "סא״ל עלים עבדאללה",
    from: "יאנוח-ג'ת",
    position: "סגן מפקד עוצבת ברעם",
    age: 40
  },
  {
    name: "ראובן הייניק",
    from: "אשקלון",
    description: "נרצח בעבודתו בקיבוץ כיסופים"
  },
  {
    name: "אוראל פסו",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "דניאל פלד",
    from: "כפר עזה"
  },
  {
    name: "גילה פלד",
    from: "כפר עזה"
  },
  {
    name: "תנ״צ (בדימוס) יזהר פלד",
    from: "כפר עזה"
  },
  {
    name: "זיו שופן",
    from: "בארי"
  },
  {
    name: "עדנה מלקמו",
    from: "אופקים"
  },
  {
    name: "רס״ב ינין סיון",
    from: "ערד",
    description: "נרצח כשעבד כמאבטח במסיבה ברעים",
    age: 49
  },
  {
    name: "שושי ברוש",
    from: "נחל עוז"
  },
  {
    name: "רב״ט רותם קוץ",
    from: "כפר עזה",
    position: "מפקדת כיתת טירונים בבה״ד 7, אגף התקשוב",
    description: "נרצחה כששהתה עם משפחתה בבית",
    age: 18
  },
  {
    name: "יפתח קוץ",
    from: "כפר עזה",
    age: 14
  },
  {
    name: "יונתן קוץ",
    from: "כפר עזה",
    age: 16
  },
  {
    name: "ליבנת קוץ",
    from: "כפר עזה"
  },
  {
    name: "אביב קוץ",
    from: "כפר עזה"
  },
  {
    name: "יהונתן רום",
    from: "מבשרת ציון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "רב״ט ליאל ויינשטיין",
    from: "נתניה",
    description: "שירתה במפקדת חטיבת האש",
    age: 19
  },
  {
    name: "רס״ר (מיל׳) עידו קסלסי",
    from: "הראל",
    description: "לוחם ביחידת מגלן, חטיבת הקומנדו",
    age: 23
  },
  {
    name: "רס״ם (מיל׳) בועז אברהם",
    from: "ניר יצחק",
    description: "חבר כיתת הכוננות ביישוב",
    age: 61
  },
  {
    name: "רס״ר (מיל') נדב עמיקם",
    from: "כפר עזה",
    description: "חבר כיתת הכוננות ביישוב",
    age: 39
  },
  {
    name: "רס״ם (מיל׳) אופיר מרדכי ירון",
    from: "מגן",
    description: "חבר כיתת הכוננות ביישוב",
    age: 51
  },
  {
    name: "סמל שלו דגן",
    from: "קרית ים",
    description: "לוחם בגדוד 51, חטיבת גולני",
    age: 20
  },
  {
    name: "ליאור אטיאס",
    from: "רחובות",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "אדיר טמם",
    from: "חולון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "איתי יוסטון הדר",
    from: "חולון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "יוחאי אזולאי",
    from: "חולון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "מעיין מור",
    from: "חולון",
    description: "נרצחה במסיבה ברעים",
    age: 30
  },
  {
    name: "תמר סמט",
    from: "פרדס חנה-כרכור",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "לאור אברמוב",
    from: "פרדס חנה-כרכור",
    description: "נרצח במסיבה ברעים",
    age: 20
  },
  {
    name: "תומר ערבה",
    from: "נחל עוז",
    age: 17
  },
  {
    name: "דניאל שיינקרמן",
    from: "חולון",
    description: "נרצח במסיבה ברעים",
    age: 25
  },
  {
    name: "איתי בנג'ו",
    from: "חיפה",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "גידי חיאל",
    from: "אחוזת ברק",
    description: "נרצח במסיבה ברעים",
    age: 24
  },
  {
    name: "נועה חיאל",
    from: "אחוזת ברק",
    description: "נרצחה במסיבה ברעים",
    age: 27
  },
  {
    name: "סאן אמנון יעקובוב",
    from: "חולון",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "סמ״ר דור מנגדי",
    from: "ראש העין",
    position: "לוחם ביחידת מתפ״א",
    description: "נפל בקרב בקיבוץ בארי",
    age: 24
  },
  {
    name: "סמ״ר גדיף מולוגטה",
    from: "קריית גת",
    position: "לוחם ביחידת מתפ״א",
    description: "נפל בקרב בקיבוץ בארי",
    age: 29
  },
  {
    name: "רס״מ בוריס דנילוב",
    from: "חדרה",
    position: "לוחם ביחידת מתפ״א",
    description: "נפל בקרב בקיבוץ בארי",
    age: 34
  },
  {
    name: "דניאל ראשד",
    from: "שפרעם",
    position: "לוחם בגדוד 13 בגולני",
    age: 19
  },
  {
    name: "סגן אמתי צבי גרנות",
    from: "תל אביב",
    position: "מפקד צוות בגדוד 75, עוצבת סער מגולן",
    age: 24
  },
  {
    name: "מרינה לוסב",
    from: "בארי"
  },
  {
    name: "נרקיס הנד",
    from: "בארי"
  },
  {
    name: "חן אבן",
    from: "בארי"
  },
  {
    name: "תאיר בירה",
    from: "בארי"
  },
  {
    name: "כנרת גת",
    from: "בארי"
  },
  {
    name: "אדריאן נטע",
    from: "בארי"
  },
  {
    name: "רס״ן (במיל') רם נגבי",
    from: "עין השלושה",
    position: "רבש״צ הקיבוץ",
    age: 57
  },
  {
    name: "סמל אופיר שושני",
    from: "כפר עזה",
    position: "מפקדת כיתת טירונים בבסיס מפרשית",
    age: 20
  },
  {
    name: "סא״ל עלים עבדאללה",
    from: "יאנוח-ג'ת",
    position: "סגן מפקד החטיבה המרחבית 300",
    age: 40
  },
  {
    name: "ליאור אסולין",
    age: 43
  },
  {
    name: "רן פוסלושני",
    from: "נחל עוז",
    age: 48
  },
  {
    name: "שיר ירון",
    from: "צוחר"
  },
  {
    name: "דן דמרי",
    from: "צוחר"
  },
  {
    name: "סילביה מרנסקי",
    from: "עין השלושה"
  },
  {
    name: "נועה גלזברג",
    from: "עין השלושה"
  },
  {
    name: "מוטי אלקבץ",
    from: "יתד"
  },
  {
    name: "נוי מעודי",
    from: "יתד"
  },
  {
    name: "נועם רביע",
    from: "דקל"
  },
  {
    name: "יובל רביע",
    from: "דקל"
  },
  {
    name: "ציון לוי",
    from: "דקל"
  },
  {
    name: "שיר ג'ורג'י",
    from: "ראשון לציון"
  },
  {
    name: "שרגא חסיד",
    from: "מזכרת בתיה",
    description: "נהרג מפגיעת רקטה כשיצא מביקור אצל חברו הפצוע בביה\"ח ברזילי",
    age: 77
  },
  {
    name: "רס״ם (במיל׳) אברהם גבריאל קורין",
    from: "חולית",
    position: "רבש״צ הקיבוץ",
    age: 56
  },
  {
    name: "רס״ן (במיל׳) אורי שמעון רוסו",
    from: "כפר עזה",
    description: "חבר כיתת הכוננות בקיבוץ",
    age: 44
  },
  {
    name: "סמ״ר (במיל׳) עומר ניסים ביתן",
    from: "בנימינה",
    description: "לוחם בגדוד 8111, חטיבה 5",
    age: 22
  },
  {
    name: "סמל אליסף בן פורת",
    from: "צפת",
    description: "טבח בגדוד 411, חטיבה 282",
    age: 21
  },
  {
    name: "רס״ר (במיל׳) שחר אביאני",
    from: "כפר עזה",
    description: "רבש״ץ כפר עזה",
    age: 56
  },
  {
    name: "רב״ט קאמיי אחיאל",
    from: "ראש העין",
    description: "לוחמת סנפיר בפלגה 914, נהרגה כתוצאה מתקלה באמצעי לחימה בפעילות מבצעית\n        במרחב הימי ליד גבול לבנון",
    age: 18
  },
  {
    name: "סמל עדי לנדמן",
    from: "יקנעם עילית",
    description: "תצפיתנית בגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "רב״ט אושר שמחה ברזילי",
    from: "מזכרת בתיה",
    description: "סמלת מבצעים בחטיבה הצפונית",
    age: 19
  },
  {
    name: "רס״ר (במיל') שחף ברגשטין",
    from: "כפר עזה",
    description: "חבר כיתת הכוננות בקיבוץ",
    age: 33
  },
  {
    name: "רס״ם איברהים ח'רובה",
    from: "מראר",
    description: "גשש בחטיבה הצפונית באוגדת עזה",
    age: 39
  },
  {
    name: "רב״ט תומר ליבוביץ'",
    from: "תל אביב",
    description: "גדוד 75, חטיבה 7 עוצבת סער מגולן",
    age: 19
  },
  {
    name: "סמל ים גולדשטיין אלמוג",
    from: "כפר עזה",
    description: "מפקדת כיתת טירונים בבה\"ד 7, אגף התקשוב",
    age: 20
  },
  {
    name: "סרן (במיל') יעקב נדלין",
    from: "אור עקיבא",
    description: "לוחם בגדוד 7037 בחטיבת שומרון, נהרג מירי כוחותינו בפעילות ליד הכפר\n        אימתין",
    age: 36
  },
  {
    name: "רס״ר שרון ליבוביץ'",
    description: "סייר תנועה בתחנת אופקים, מחוז דרום"
  },
  {
    name: "פקד דן גנות",
    from: "חריש",
    description: "סגן מפקד פלגה ביחידה לתיאום פעולות אכיפה (מתפ\"א), נפל בקרב בבארי",
    age: 41
  },
  {
    name: "רפ״ק אבי עמר",
    from: "עוצם",
    description: "מפקד זרוע תשתיות ביחידת יואב, מחוז דרום",
    age: 55
  },
  {
    name: "לין דפני",
    from: "קיבוץ עין המפרץ",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "מאיה ג'יבלי",
    from: "כפר חיים"
  },
  {
    name: "רוני שטרית",
    from: "בית יצחק",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "עדי מרגלית",
    from: "חניאל",
    description: "נרצחה במסיבה ברעים",
    age: 24
  },
  {
    name: "גיל יוסף אבני",
    from: "קיסריה",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "אוריה ליטמן ריקרדו",
    from: "קיסריה",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "יונתן ריכטר",
    from: "עין הוד",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "רב״ט מתן מלכה",
    from: "קיבוץ גשר הזיו",
    description: "לוחם בגדוד 101, חטיבת הצנחנים",
    age: 19
  },
  {
    name: "ירדן בוסקילה",
    from: "קיבוץ כפר מסריק",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "זיו פרנקל",
    from: "בוסתן הגליל",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "מפל אדם",
    from: "הרצליה",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "מור טרבלסי",
    from: "נהריה",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "חי חיים צפתי",
    from: "קרית אתא",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "רחל (רייצ'ל) דב",
    from: "קרית ים",
    description: "נרצחה במסיבה ברעים",
    age: 25
  },
  {
    name: "מוריה רביב",
    from: "קרית מוצקין",
    description: "נרצחה במסיבה ברעים",
    age: 23
  },
  {
    name: "דניאלה (דנה) פטרנקו",
    from: "חיפה",
    age: 23
  },
  {
    name: "נועה אנגלנדר",
    from: "קרית ביאליק",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "סאמי אלגרגאוי"
  },
  {
    name: "עבד אלקרים אלנסאסרה"
  },
  {
    name: "אור זיו",
    from: "עדי"
  },
  {
    name: "איתן שניר",
    from: "אחוזת ברק",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "דין בר",
    from: "אחוזת ברק",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "בן ברנשטיין",
    from: "ציפורי",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "ליאור מימון",
    from: "רמת גן",
    description: "נרצחה במסיבה ברעים",
    age: 22
  },
  {
    name: "אביב אליהו",
    from: "אלקוש",
    description: "היה אחראי על אבטחת המסיבה ברעים ונרצח"
  },
  {
    name: "קים דמתי",
    from: "גדרה",
    description: "נרצחה במסיבה ברעים",
    age: 22
  },
  {
    name: "שי רגב",
    from: "רמת ישי",
    description: "נרצחה במסיבה ברעים",
    age: 25
  },
  {
    name: "אורון ביילין",
    from: "רמת גן",
    description: "נרצח במסיבה ברעים",
    age: 24
  },
  {
    name: "מור כהן",
    from: "אזור",
    description: "נרצח במסיבה ברעים",
    age: 24
  },
  {
    name: "סרן גיא אדמוני",
    from: "כפר עזה",
    description: "קצין באגף המודיעין",
    age: 25
  },
  {
    name: "סגן דור שדה",
    from: "ערוגות",
    description: "מפקד מחלקה בגדוד צבר, חטיבת גבעתי",
    age: 22
  },
  {
    name: "סמל (מיל') עדי אודיה ברוך",
    from: "קרית נטפים",
    description: "סמלת מבצעים בחטיבה מרחבית יהודה",
    age: 22
  },
  {
    name: "סמל רואי חיים גורי",
    from: "אופקים",
    description: "לוחם בסיירת חטיבת גולני",
    age: 21
  },
  {
    name: "סמ״ר איתי אברהם רון",
    from: "נס ציונה",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "סמל עמרי פרץ",
    from: "אליכין",
    description: "מפקד כיתה בגדוד 450, ביסל״ח",
    age: 20
  },
  {
    name: "לירז ניסן",
    from: "כרמיאל",
    description: "נרצחה במסיבה ברעים"
  },
  {
    name: "מתן ליאור מרדכי",
    from: "שדי חמד",
    description: "נרצח במסיבה ברעים",
    age: 35
  },
  {
    name: "עינב אלקיים לוי",
    from: "גבעתיים",
    description: "נרצחה במסיבה ברעים",
    age: 32
  },
  {
    name: "בן פישמן",
    from: "כפר סבא",
    description: "נרצח במסיבה ברעים",
    age: 21
  },
  {
    name: "רס״ר אהרון ארתור מרקוביצ'י",
    description: "רכז ועדות רכש במחלקת רכישות ומכירות (מרו\"מ)"
  },
  {
    name: "סמל בנימין בלאי",
    from: "רחובות",
    description: "נהג בחטיבה הדרומית",
    age: 20
  },
  {
    name: "רס״ם (מיל') גיל אביטל",
    from: "ישע",
    description: "חבר בכיתת הכוננות",
    age: 56
  },
  {
    name: "סמל אורי כרמי",
    from: "ראשון לציון",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "רב״ט נחמן דקל",
    from: "חולון",
    description: "לוחם בגדוד 50, חטיבת הנח״ל",
    age: 20
  },
  {
    name: "סרן (במיל') אברהם חננאל הנדי",
    from: "כפר עזה",
    description: "סגן רבש\"ץ",
    age: 37
  },
  {
    name: "רס״ר (במיל') אביב ברעם",
    from: "כפר עזה",
    description: "חבר כיתת כוננות",
    age: 33
  },
  {
    name: "סמ״ר שלמה רשטניקוב",
    from: "חיפה",
    description: "לוחם בגדוד 51, חטיבת גולני",
    age: 20
  },
  {
    name: "סמ״ר ענר אלקים שפירא",
    from: "ירושלים",
    description: "לוחם בסיירת נח״ל",
    age: 22
  },
  {
    name: "אל״ם (במיל') ליאון בר",
    from: "גדרה",
    description: "קצין בכיר באוגדת איו״ש",
    age: 53
  },
  {
    name: "סמ״ר דניאל בזגודוב",
    from: "עפולה",
    description: "לוחם בסיירת נח״ל",
    age: 22
  },
  {
    name: "רס״ב (מיל') אברהם פלישר",
    from: "מגן",
    description: "חבר כיתת כוננות",
    age: 63
  },
  {
    name: "סמ״ר איתמר בן יהודה",
    from: "רחובות",
    description: "מפקד כיתה בגדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "עומרי לביא",
    from: "צפת",
    description: "נרצח במסיבה ברעים",
    age: 25
  },
  {
    name: "דניאל וולדמן",
    description: "נרצחה במסיבה ברעים",
    age: 24
  },
  {
    name: "מיכאל בן משה",
    from: "אשקלון",
    description: "איש שירות הביטחון הכללי. נפל בקרב עם מחבלים",
    age: 26
  },
  {
    name: "רב״ט אופיר ירוחין",
    from: "גבעת שמואל",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 19
  },
  {
    name: "סמ״ר (מיל׳) מתניה אלסטר",
    from: "שדה אילן",
    description: "לוחם בגדוד 221, חטיבת כרמלי. נהרג מירי נ\"ט לעבר כוח צה״ל בצפון הארץ",
    age: 23
  },
  {
    name: "סמ״ר אופק ארביב",
    from: "בת ים",
    description: "לוחם בגדוד 101, חטיבת הצנחנים",
    age: 21
  },
  {
    name: "רס״ל (מיל׳) דניאל קסטיאל",
    from: "בית שמש",
    description: "לוחם ביחידת מגלן, חטיבת הקומנדו",
    age: 24
  },
  {
    name: "סרן (מיל׳) אמיר נעים",
    from: "ארז",
    description: "קצין הנדסה במפקדת חטיבת גולני",
    age: 27
  },
  {
    name: "סגן עומר וולף",
    from: "גבעת חיים (מאוחד)",
    description: "סגן מפקד פלוגה בגדוד 51, חטיבת גולני",
    age: 22
  },
  {
    name: "רס״ל ישי סלוטקי",
    from: "באר שבע",
    description: "לוחם בגדוד 7006, חטיבת עודד",
    age: 24
  },
  {
    name: "רס״ן עידו חוברה",
    from: "סופה",
    description: "קצין לוחם בחטיבה 401",
    age: 36
  },
  {
    name: "טוראי עידן ברוך",
    from: "בארי",
    description: "מש״ק הוראה בבה״ד חינוך",
    age: 20
  },
  {
    name: "סמל אור מזרחי",
    from: "רמת גן",
    description: "לוחם בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "סמ״ר נטע בר עם",
    from: "חדרה",
    description: "לוחם בגדוד 414, חיל הגנת הגבולות",
    age: 21
  },
  {
    name: "רס״ל (מיל׳) איתי שלמה מורנו",
    from: "אדרת",
    description: "איש שירות הביטחון הכללי, נפל בעת שירות מילואים ביחידת מגלן בקרב עם\n        מחבלים",
    age: 24
  },
  {
    name: "סמל מארו אלם",
    from: "אשקלון",
    description: "לוחם בגדוד 51, חטיבת גולני",
    age: 20
  },
  {
    name: "סמ״ר נהוראי לוי אמיתי",
    from: "רינתיה",
    description: "מפקד כיתה בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "סרן (מיל׳) אלחנן מאיר קלמנזון",
    from: "עתניאל",
    description: "קצין במפקדת אוגדת יהודה ושומרון",
    age: 41
  },
  {
    name: "רס״ן בנימין (בנג׳י) טרקניסקי",
    from: "תל אביב",
    description: "קצין אג״ם בחטיבה 7",
    age: 32
  },
  {
    name: "סמל גלי רועי שקותאי",
    from: "צופר",
    description: "לוחם בסיירת נח״ל, חטיבת הנח״ל",
    age: 21
  },
  {
    name: "סמ״ר נדב ביטון",
    from: "אופקים",
    description: "לוחם בגדוד 90, חטיבת כפיר",
    age: 20
  },
  {
    name: "רב״ט שוהם שלמה נידם",
    from: "קריית שמונה",
    description: "טכנאי בגדוד 13, חטיבת גולני",
    age: 19
  },
  {
    name: "רב״ט יותם הלל",
    from: "ברקת",
    description: "לוחם בסיירת נח״ל, חטיבת הנח״ל",
    age: 19
  },
  {
    name: "סמ״ר דור לזימי",
    from: "כפר תבור",
    description: "מפקד כיתה בגדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "רס״מ שרון רחמני",
    from: "רעים",
    description: "חוקרת בימ\"ר נגב"
  },
  {
    name: "דניאל בן סניור",
    from: "אור עקיבא"
  },
  {
    name: "יורסלב גילר",
    from: "כרמיאל",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "יאיר זלוף",
    from: "תל מונד",
    description: "מתמחה ברפואת ילדים במחלקת ילדים ב׳ במרכז שניידר לרפואת ילדים"
  },
  {
    name: "רם סלע",
    from: "נווה אור",
    description: "נרצח במסיבה ברעים"
  },
  {
    name: "בר שכטר",
    description: "אמן שהופיע במסיבה ברעים"
  },
  {
    name: "עואד דראוושה",
    description: "פראמדיק שהיה במסיבה ברעים"
  },
  {
    name: "יצחק קוזין",
    from: "בארי"
  },
  {
    name: "יהונתן רפופורט",
    from: "בארי"
  },
  {
    name: "חגי אבני",
    from: "בארי",
    description: "חבר כיתת הכוננות בקיבוץ"
  },
  {
    name: "מני גודארד",
    from: "בארי"
  },
  {
    name: "מתי וייס",
    from: "בארי"
  },
  {
    name: "עמיר וייס",
    from: "בארי"
  },
  {
    name: "גאולה בכר",
    from: "בארי"
  },
  {
    name: "רן שפר",
    from: "בארי"
  },
  {
    name: "רס״ר (במיל') גיל בויום",
    from: "בארי",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 55
  },
  {
    name: "ענבר בויום",
    from: "בארי"
  },
  {
    name: "חיים זוהר",
    from: "בארי"
  },
  {
    name: "אמילי הנד",
    from: "בארי"
  },
  {
    name: "עדי דגן",
    from: "בארי"
  },
  {
    name: "מרדכי נווה",
    from: "בארי"
  },
  {
    name: "רוני לוי",
    from: "בארי"
  },
  {
    name: "נוי שוש",
    from: "בארי",
    position: "חבר כיתת הכוננות בקיבוץ"
  },
  {
    name: "אריק קראוניק",
    from: "בארי"
  },
  {
    name: "איתן חדד",
    from: "בארי"
  },
  {
    name: "שחר צמח",
    from: "בארי",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 39
  },
  {
    name: "סמי קידר",
    from: "בארי"
  },
  {
    name: "גלית קרבונה",
    from: "בארי"
  },
  {
    name: "אבי מור",
    from: "בארי"
  },
  {
    name: "שגב ישראל קיז'נר",
    from: "עצמון"
  },
  {
    name: "איילת ארנין",
    from: "עצמון"
  },
  {
    name: "נעמה מועלם",
    from: "בית שאן"
  },
  {
    name: "שוהם תורג'מן",
    from: "בית שאן",
    description: "נרצחה במסיבה ברעים",
    age: 24
  },
  {
    name: "רס״ל אוראל שלום אלון",
    from: "קרית אתא",
    description: "לוחם ביחידה לתיאום פעולות אכיפה (מתפ״א), נפל בקרבות בבארי",
    age: 23
  },
  {
    name: "ניר מדמון",
    from: "פדויים",
    age: 23
  },
  {
    name: "סמל אדיר אישטו בוגלה",
    from: "אריאל",
    description: "טכנאי בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "סתיו ברזני",
    from: "גן נר",
    description: "נרצחה במסיבה ברעים",
    age: 23
  },
  {
    name: "סטיבן מקרצ׳נקו",
    from: "כרמיאל",
    description: "נרצח במסיבה ברעים",
    age: 24
  },
  {
    name: "סמל שחף ניסני",
    from: "אשקלון",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "רב״ט בועז מנשה יוגב",
    from: "טלמון",
    description: "טכנאי מערכות הגנה בחטיבה צפונית",
    age: 19
  },
  {
    name: "רס״ר (מיל׳) נועם סלוטקי",
    from: "באר שבע",
    description: "חובש קרבי בגדוד 221, חטיבת כרמלי",
    age: 31
  },
  {
    name: "סמ״ר ישי פיטוסי",
    from: "טלמון",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "רב״ט אמיר איל",
    from: "חיפה",
    description: "לוחם איסוף בגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "סמל נריה בן דוד",
    from: "חיפה",
    description: "מפקד כיתה בגדוד 603, חיל ההנדסה הקרבית",
    age: 22
  },
  {
    name: "סמל ירין מארי פלד",
    from: "בארי",
    description: "חובשת בחטיבה צפונית",
    age: 20
  },
  {
    name: "סמל נועה פרייס",
    from: "מבועים",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "רב״ט חביב קיעאן",
    from: "חורה",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "סמל דביר חיים רסלר",
    from: "קדומים",
    description: "לוחם בגדוד 51, חטיבת גולני",
    age: 21
  },
  {
    name: "רב״ט יעל לייבושור",
    from: "גיאה",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "סג״ם סהר טל",
    from: "צרעה",
    description: "קצין מודיעין המידע בגדוד 77, חטיבה 7",
    age: 20
  },
  {
    name: "רב״ט מתן מלכה",
    from: "גשר הזיו",
    description: "לוחם בגדוד 101, חטיבת הצנחנים",
    age: 19
  },
  {
    name: "טוראי הדר מרים כהן",
    from: "זיתן",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 18
  },
  {
    name: "סמ״ר שהם בר",
    from: "אחוזת ברק",
    description: "נגד לוגיסטיקה במפקדת חטיבת גולני",
    age: 21
  },
  {
    name: "סמ״ר דניאל קסבצ׳וק",
    from: "שדרות",
    description: "טכנאי אלקטרומכניקה ביחידת מורן, עוצבת קלע דוד",
    age: 21
  },
  {
    name: "רס״ם (במיל') אילן פיורנטינו",
    from: "נחל עוז",
    description: "חבר כיתת הכוננות",
    age: 38
  },
  {
    name: "סמל איתי אופק גליסקו",
    from: "יקנעם עילית",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "רב״ט בנימין גבריאל יונה",
    from: "ירושלים",
    description: "נהג משא כבד בגדוד 947, מערך ההגנה האווירית",
    age: 19
  },
  {
    name: "טוראי לידור מקייס",
    from: "אופקים",
    description: "מש\"ק לוגיסטיקה ביחידת מתאם פעולות הממשלה בשטחים",
    age: 19
  },
  {
    name: "סמל ברק בן דוד",
    from: "דימונה",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 19
  },
  {
    name: "רב״ט נתיב קוצרו",
    from: "מעלה אדומים",
    description: "טכנאי שו\"ב ומשגר בגדוד 974, מערך ההגנה האווירית",
    age: 21
  },
  {
    name: "סמל ולנטין (אלי) גנסיה",
    from: "ירושלים",
    description: "לוחם בגדוד 890, חטיבת הצנחנים",
    age: 22
  },
  {
    name: "רב״ט שמעון לוגאסי",
    from: "עכו",
    description: "לוחם איסוף בגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "רב״ט קארין שוורצמן",
    from: "חולון",
    description: "טכנאית מערכות הספק ובקרה בלהק ציוד בחיל האוויר",
    age: 20
  },
  {
    name: "סגן רועי נהרי",
    from: "אורה",
    description: "מפקד מחלקה בגדוד 202, חטיבת הצנחנים",
    age: 23
  },
  {
    name: "רס״ר (מיל') לירן מונס אלמוסנינו",
    from: "כמהין",
    description: "פלס בחטיבה מרחבית פארן",
    age: 42
  },
  {
    name: "רס״ם (במיל') יפתח גורני",
    from: "באר מילכה",
    position: "חבר כיתת הכוננות במושב",
    age: 51
  },
  {
    name: "מאיה פודר",
    from: "זכרון יעקב"
  },
  {
    name: "טוראי שירת ים עמר",
    from: "קרית אונו",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 18
  },
  {
    name: "סמל נאור סיבוני",
    from: "גילת",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 20
  },
  {
    name: "מפקח קים דוקרקר",
    description: "מפקדת מחלקה ביחידת הסיירות, מג\"ב מרכז"
  },
  {
    name: "רב״ט אביב חג'ג'",
    from: "גילת",
    description: "בקרית איסוף יבשתי מגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "סרן שגיא גולן",
    from: "רעננה",
    description: "קצין בביה״ס ללוט״ר",
    age: 30
  },
  {
    name: "רב״ט עילי נועם בן מוחה",
    from: "אשדוד",
    description: "לוחם בגדוד 51, חטיבת גולני",
    age: 20
  },
  {
    name: "סגן עידן באלוי",
    from: "ראשון לציון",
    description: "קצין הקשר הגדודי של גדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "סמל שמעון אלרואי בן שטרית",
    from: "בית שאן",
    description: "לוחם איסוף בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "סמ״ר אופק רוסו",
    from: "קדימה-צורן",
    description: "צוללן בשייטת 13",
    age: 21
  },
  {
    name: "סגן שילה ראוכברגר",
    from: "עלי",
    description: "מפקד מחלקה בגדוד 51, חטיבת גולני",
    age: 23
  },
  {
    name: "סג״ם יובל יפה",
    from: "צופית",
    description: "קצין מטה בחטיבה 7",
    age: 21
  },
  {
    name: "רב״ט שיראל מור",
    from: "רעננה",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "סמל דניאל שפרבר",
    from: "יהוד-מונוסון",
    description: "לוחם איסוף בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "סמ״ר דור ירחי",
    from: "ראשון לציון",
    description: "לוחם בגדוד 13, חטיבת גולני",
    age: 21
  },
  {
    name: "סמ״ר אביאל מלקמו",
    from: "קרית אתא",
    description: "לוחם ביחידת אגוז, חטיבת הקומנדו",
    age: 21
  },
  {
    name: "טוראי מיה ויאלובו פולו",
    from: "גבעתיים",
    description: "בקרית איסוף יבשתי בגדוד 414, חיל הגנת הגבולות",
    age: 19
  },
  {
    name: "סמל אדם אגמון",
    from: "כמון",
    description: "מפקד כיתה בגדוד 450, ביסל\"ח",
    age: 21
  },
  {
    name: "רס״ל איתי יהודה באוסי",
    from: "קבוצת יבנה",
    description: "לוחם ביחידת דובדבן, חטיבת הקומנדו",
    age: 22
  },
  {
    name: "רס״ר גיל תעסה",
    from: "נתיב העשרה",
    description: "מפקד צוות כיבוי בתחנת כיבוי אשקלון, נהרג בהתקלות עם מחבלים בנתיב העשרה",
    age: 46
  },
  {
    name: "אביה חצרוני",
    from: "קיבוץ בארי",
    description: "חובש בכיר במד\"א, נרצח בביתו בקיבוץ בארי",
    age: 69
  },
  {
    name: "רב״ט אור אביטל",
    from: "מרום גולן",
    description: "נהרג בעוטף עזה"
  },
  {
    name: "רס״מ יקיר בלוכמן",
    description: "בלש בתחנת שגב שלום שנהרג בלחימה מול מחבלים בקיבוץ רעים"
  },
  {
    name: "סמל אביעד שר שלום ריבלין",
    from: "עתניאל",
    description: "חייל בחטיבה הטכנולוגית ליבשה"
  },
  {
    name: "יוסף (ספי) גניס",
    from: "רמת גן",
    description: "נרצח במסיבת הטבע סמוך לקיבוץ רעים",
    age: 30
  },
  {
    name: "גל נבון",
    from: "רמת גן",
    age: 19
  },
  {
    name: "עמית מן",
    from: "קיבוץ בארי",
    position: "פראמדיקית במד״א",
    description: "נורתה למוות על ידי מחבלים כשנכנסו למרפאה בקיבוץ בארי כאשר טיפלה בפצועים",
    age: 22
  },
  {
    name: "מתן אברג'יל",
    from: "חרמש",
    position: "לוחם גולני",
    description: "נפל סמוך למחסום ארז",
    age: 19
  },
  {
    name: "אורי ארד"
  },
  {
    name: "רותם ניימן",
    from: "כפר הס",
    description: "נרצחה במסיבת הטבע סמוך לקיבוץ רעים"
  },
  {
    name: "טל כץ",
    from: "מעלות תרשיחא",
    description: "נרצח במסיבת הטבע סמוך לקיבוץ רעים"
  },
  {
    name: "ניב תל צור",
    from: "רמת גן",
    description: "נרצח במסיבת הטבע סמוך לקיבוץ רעים",
    age: 22
  },
  {
    name: "סגן שיר אילת",
    from: "כפר שמואל",
    position: "מפקדת מחלקה בגדוד 414, חיל הגנת הגבולות",
    age: 20
  },
  {
    name: "עוז עזרא",
    from: "חולון"
  },
  {
    name: "לי דור לוי",
    from: "כפר סבא",
    age: 28
  },
  {
    name: "סג״מ יוחאי דוכן",
    from: "קרית ארבע"
  },
  {
    name: "מאיה ביטון",
    from: "פתח תקווה",
    position: "ארוסתו של אלירן מזרחי ז״ל",
    age: 22
  },
  {
    name: "אלירן מזרחי",
    from: "פתח תקווה",
    position: "ארוסה של מאיה ביטון ז״ל",
    age: 24
  },
  {
    name: "ירין משה אפריים",
    from: "פתח תקווה",
    age: 24
  },
  {
    name: "אולגה נעמי רומשקין",
    from: "פתח תקווה",
    age: 28
  },
  {
    name: "חנני גלזר",
    from: "פתח תקווה",
    age: 24
  },
  {
    name: "מאיה חיים",
    from: "פתח תקווה",
    age: 22
  },
  {
    name: "דניאל גולטמן",
    from: "ראשון לציון",
    age: 24
  },
  {
    name: "יהב וינר",
    from: "כפר עזה",
    position: "חבר הסגל המנהלי בביה״ס לאמנויות הקול והמסך, ספיר"
  },
  {
    name: "איתי ברדיצ'סקי",
    from: "כפר עזה"
  },
  {
    name: "הדר רוזנפלד-ברדיצ'סקי",
    from: "כפר עזה",
    position: "בוגרת המחלקה לכלכלה, ספיר"
  },
  {
    name: "סרן בן ברונשטיין",
    from: "חולון",
    position: "לוחם ביחידת דובדבן",
    age: 24
  },
  {
    name: "רב״ט עמיחי שמעון רובין",
    from: "עכו",
    position: "לוחם בגדוד 51 בגולני",
    age: 23
  },
  {
    name: "רס״ר (במיל') בכור סויד",
    from: "שלומית",
    position: "חבר כיתת הכוננות בשלומית",
    age: 32
  },
  {
    name: "רב״ט אמיל סמוילוב",
    from: "חיפה",
    position: "מאבטח מתקנים במתפ״ש",
    age: 22
  },
  {
    name: "סמל סהר מידאני",
    from: "קריית עקרון",
    position: "לוחם בגדוד 13 בגולני",
    age: 20
  },
  {
    name: "סמ״ר תומר יעקב מזרחי",
    from: "הושעיה",
    position: "לוחם בסיירת נח״ל",
    age: 21
  },
  {
    name: "רב״ט איתמר כהן",
    from: "כרמיאל",
    position: "לוחם בגדוד 13 בגולני",
    age: 19
  },
  {
    name: "סמ״ר דביר זכאי",
    from: "טבריה",
    position: "לוחם בגדוד 13 בגולני",
    age: 20
  },
  {
    name: "רס״ן עילי זיסר",
    from: "גבעת אלה",
    position: "לוחם בסיירת מטכ״ל",
    age: 27
  },
  {
    name: "רב״ט עידו ביננשטוק",
    from: "רמת גן",
    position: "לוחם בגדוד 13 בגולני",
    age: 19
  },
  {
    name: "סגן איליי עדני",
    from: "תל מונד",
    position: "קצין לוחם במגלן",
    age: 21
  },
  {
    name: "טוראית נועם אברמוביץ",
    from: "גבעת ברנר",
    position: "בקרית איסוף יבשתי בגדוד 414 בחיל הגנת הגבולות",
    age: 19
  },
  {
    name: "סמ״ר דולב אמויאל",
    from: "נתניה",
    position: "לוחם בגדוד 13 גולני",
    age: 21
  },
  {
    name: "אורן אלפסי",
    from: "רמת השרון",
    description: "נהרג מירי מחבלים בקיבוץ נירים"
  },
  {
    name: "דניאל לוי",
    from: "בארי",
    position: "רופא במרכז הרפואי סורוקה בבאר שבע"
  },
  {
    name: "ברונה ולאנו",
    from: "פתח תקווה",
    position: "עלתה מברזיל עם אמה ואחותה, הייתה סטודנטית באוניברסיטת ת״א"
  },
  {
    name: "בן מנשה מזרחי",
    from: "קבוצת יבנה",
    position: "אזרח אמריקאי, שירת כחייל בודד ואומץ על ידי משפחה בקבוצת יבנה"
  },
  {
    name: "דן אריאל",
    from: "הרצליה",
    position: "בנו של פרופ' מאיר אריאל, ראש המרכז לננו לווינים"
  },
  {
    name: "סמדר מור עידן",
    from: "כפר עזה",
    position: "עובדת שב״כ",
    description: "נהרגה בעת פשיטת מחבלים על ביתה בכפר עזה",
    age: 38
  },
  {
    name: "עומר גברה",
    from: "גן יבנה",
    position: "עובד שב״כ",
    description: "נהרג בלחימה מול חוליות מחבלים בעוטף עזה",
    age: 26
  },
  {
    name: "איתי יהושע",
    from: "חדיד",
    position: "עובד שב״כ",
    description: "נהרג בלחימה מול חוליות מחבלים בעוטף עזה",
    age: 36
  },
  {
    name: "סגן אמיר צור",
    from: "ירושלים",
    position: "לוחם בסיירת מטכ״ל",
    age: 23
  },
  {
    name: "סמל עמית מוסט",
    from: "מודיעין",
    position: "לוחם בסיירת נח״ל",
    age: 20
  },
  {
    name: "סמ״ר רועי ברקת",
    from: "תל אביב",
    position: "מ״כ בגדוד 13 בגולני",
    age: 20
  },
  {
    name: "סגן אייל קליין",
    from: "כפר הרי״ף",
    position: "לוחם בסיירת נח״ל",
    age: 22
  },
  {
    name: "סמ״ר יונתן סביצקי",
    from: "מודיעין",
    position: "לוחם ביחידת אגוז",
    age: 21
  },
  {
    name: "סמל רגב אמר",
    from: "שדה נחמיה",
    position: "לוחם בגדוד 101 בצנחנים",
    age: 20
  },
  {
    name: "סמל אופיר מלמן",
    from: "ניר יצחק",
    position: "לוחם בסיירת נח״ל",
    age: 21
  },
  {
    name: "סגן סהר סעודין",
    from: "ראש העין",
    position: "קצינת הדרכה בגדוד 947 במערך ההגנה האווירית",
    age: 21
  },
  {
    name: "רס״ל (מיל) אביחי אמסלם",
    from: "חדרה",
    position: "לוחם בגדוד 7008 בעוצבת חצי האש",
    age: 30
  },
  {
    name: "רב״ט דוד מיטלמן",
    from: "ראש צורים",
    position: "לוחם בגדוד 51 בגולני",
    age: 20
  },
  {
    name: "סמל נהוראי סעיד",
    from: "אופקים",
    position: "לוחם בגדוד 92 בחטיבת כפיר",
    age: 21
  },
  {
    name: "סמל בר רוזנשטיין",
    from: "ראשון לציון",
    position: "לוחם בגדוד 51 בגולני",
    age: 20
  },
  {
    name: "סמל שלו ברנס",
    from: "כפר ברוך",
    position: "לוחם בגדוד 13 בגולני",
    age: 20
  },
  {
    name: "רס״ן אוריאל ביבי",
    from: "שלומית",
    position: "לוחם בגדוד 202 בצנחנים",
    age: 30
  },
  {
    name: "סמ״ר אלעד מיכאל ששון",
    from: "מוצא עילית",
    position: "לוחם באגוז",
    age: 21
  },
  {
    name: "רס״ם סלמאן אבן מרעי",
    from: "שגב שלום",
    position: "גשש בחטיבה הדרומית באוגדת עזה",
    age: 41
  },
  {
    name: "סרן (מיל') יובל הליבני",
    from: "רמת גן",
    position: "לוחם בגדוד 7008 עוצבת חצי האש",
    age: 30
  },
  {
    name: "רב״ט נתן חן ליאר",
    from: "נתניה",
    position: "לוחם בגדוד 94 בחטיבת כפיר",
    age: 20
  },
  {
    name: "רס״ן (מיל') איתן מנחם נאמן",
    from: "טנא",
    position: "רופא לוחם בגדוד 7008 עוצבת חצי האש, היה רופא בסורוקה",
    age: 44
  },
  {
    name: "רב״ט לביא בוחניק",
    from: "פדויים",
    position: "לוחם בגדוד 101 בצנחנים",
    age: 20
  },
  {
    name: "סמל ברנדו דוד פלורס גרסיה",
    from: "באר שבע",
    position: "נהג בחטיבה הדרומית באוגדת עזה",
    age: 21
  },
  {
    name: "סמל תומר נגר",
    from: "אזור",
    position: "לוחם בגדוד 51 בגולני",
    age: 20
  },
  {
    name: "סמל נועם אלימלך רוטנברג",
    from: "באר שבע",
    position: "מתכנת במפקדת פיקוד ההכשרות והאימונים",
    age: 24
  },
  {
    name: "סגן רון צרפתי",
    from: "חדרה",
    position: "קצינת אבטחה ביחידת בקרה האווירית",
    age: 22
  },
  {
    name: "סמ״ר מיכאל בן חמו",
    from: "רחובות",
    position: "מ״כ בגדוד 51 בגולני",
    age: 21
  },
  {
    name: "סגן אורי מרדכי שני",
    from: "קריית ארבע",
    position: "מפקד מחלקה בגדוד 51 בגולני",
    age: 22
  },
  {
    name: "רב״ט בר יענקלוב",
    from: "כרמיאל",
    position: "לוחם בגדוד 101 בצנחנים",
    age: 19
  },
  {
    name: "אברהם נריה כהן",
    from: "ירושלים",
    position: "חייל במפקדת אוגדת עזה",
    age: 20
  },
  {
    name: "רב״ט שי אשרם",
    from: "רחובות",
    position: "בקרית איסוף יבשתי בגדוד 414",
    age: 19
  },
  {
    name: "רס״ל (מיל') גלעד מולכו",
    from: "תל אביב",
    position: "לוחם אגוז",
    description: "נהרג בהיתקלות עם מחבלים בגבול הצפון",
    age: 33
  },
  {
    name: "רס״ל ג'ואד עאמר",
    from: "חורפיש",
    position: "מנהל שטח אש 150",
    description: "נהרג בהיתקלות עם מחבלים בגבול הצפון",
    age: 23
  },
  {
    name: "רס״ר מור שקורי",
    position: "סיירת בתחנת שדרות"
  },
  {
    name: "רס״ר אבשלום יאיר פרץ",
    position: "לוחם ימ״מ"
  },
  {
    name: "ליאל איטח",
    from: "ענתות",
    description: "נרצח במסיבת הטבע סמוך לרעים"
  },
  {
    name: "סרן שילה הר-אבן",
    from: "עלמון",
    position: "מפקד פלוגה בגדוד 13",
    description: "נהרג בקרב בבסיס נחל עוז",
    age: 25
  },
  {
    name: "רותם דושי",
    from: "שמשית",
    position: "לוחם בצנחנים",
    description: "נהרג בקרב עם מחבלים בדרום",
    age: 20
  },
  {
    name: "בן בנציון חסיד",
    from: "ראשון לציון",
    description: "נרצח במסיבת הטבע סמוך לרעים",
    age: 23
  },
  {
    name: "שי שלום אליאור מוצפי",
    from: "בת ים",
    description: "נרצח במסיבת הטבע סמוך לרעים"
  },
  {
    name: "אלון שמלי",
    from: "בת ים",
    position: "מורה בבית ספר בבת ים",
    description: "נורה למוות בפיגוע במצרים"
  },
  {
    name: "אמנון בצלאל",
    from: "בת ים",
    position: "איש משטרה בדימוס בדרגת רנ״ג"
  },
  {
    name: "יעל רוזמן",
    from: "כפר סבא",
    description: "נרצחה במסיבת הטבע סמוך לרעים",
    age: 26
  },
  {
    name: "סופיה בונגרט",
    from: "כרמיאל",
    description: "נרצחה במסיבת הטבע סמוך לרעים"
  },
  {
    name: "אדם אילייב",
    from: "אשדוד",
    description: "נרצח במסיבת הטבע סמוך לרעים"
  },
  {
    name: "איזבלה גנדלין",
    from: "אשדוד",
    description: "נרצחה במסיבת הטבע סמוך לרעים"
  },
  {
    name: "נאור חסידים",
    from: "אשדוד",
    description: "נרצח במסיבת הטבע סמוך לרעים"
  },
  {
    name: "נעמי בייקר",
    from: "אשדוד",
    description: "נרצחה במסיבת הטבע סמוך לרעים"
  },
  {
    name: "רס״ר אלירן אברג'ל",
    from: "נתניה",
    position: "לוחם במנהלת תיאום פעולות (מתפ״א)",
    age: 29
  },
  {
    name: "רס״ב ירון מוריס דיין",
    position: "סייר הוצאה לפועל בלכיש, מחוז דרום"
  },
  {
    name: "רס״ב דוד בן דיין",
    position: "סייר תנועה בתחנת שדרות, מחוז דרום"
  },
  {
    name: "רס״ר (מיל') יובל גבאי",
    from: "רחובות",
    position: "מפקד כיתה בגדוד חי״ר קל",
    age: 35
  },
  {
    name: "אביתר אוחיון",
    from: "ירושלים",
    position: "נהג אמבולנס בגדוד 51",
    age: 22
  },
  {
    name: "רס״ן מרדכי שמיר",
    from: "יקיר",
    position: "קצין במפקדת קצין חי״ר וצנחנים ראשי",
    age: 29
  },
  {
    name: "שגב שוורץ",
    from: "בית שאן",
    position: "רגם קשת בגדוד 50",
    age: 20
  },
  {
    name: "רב״ט אוריאל סגל",
    from: "פתח תקווה",
    position: "טבח בגדוד 51",
    age: 19
  },
  {
    name: "רב״ט אמיר לביא",
    from: "ירושלים",
    position: "רגם קשת בגדוד 50",
    age: 19
  },
  {
    name: "סמ״ר עדי צור",
    from: "ירושלים",
    position: "לוחם בגדוד 51",
    age: 20
  },
  {
    name: "רב״ט ראם מאיר בטיטו",
    from: "נתניה",
    position: "לוחם בגדוד 51",
    age: 19
  },
  {
    name: "רס״ל יוסף מלאכי גדליה",
    from: "ירושלים",
    position: "לוחם ביחידת דובדבן",
    age: 22
  },
  {
    name: "רס״ל עמרי בלקין",
    from: "רמת השרון",
    position: "מדריך לוחמה בטרור",
    age: 25
  },
  {
    name: "סמל תומר ברק",
    from: "פתח תקווה",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "סמ״ר עמית פלד",
    from: "חיפה",
    position: "לוחם ביחידת אגוז",
    age: 21
  },
  {
    name: "רב״ט סיוון שמחה אסראף",
    from: "אשקלון",
    position: "רכזת אמצעי תקשוב",
    age: 20
  },
  {
    name: "רס״ר (מיל') ליאור בן יעקב",
    from: "ישע",
    position: "סגן הרבש״צ במושב",
    age: 44
  },
  {
    name: "רס״ן טל כהן",
    from: "גני טל",
    position: "לוחם בסיירת מטכ״ל",
    age: 30
  },
  {
    name: "רס״ר (מיל') טל ממן",
    from: "מושב מבטחים",
    position: "חבר כיתת הכוננות ביישוב",
    age: 38
  },
  {
    name: "רב״ט אריאל ארז",
    from: "עמקה",
    position: "לוחם בגדוד 13",
    age: 19
  },
  {
    name: "רב״ט אריאל אוחנה",
    from: "רבדים",
    position: "לוחם בגדוד 890",
    age: 19
  },
  {
    name: "סמל איתי נחמיאס",
    from: "מושב ישע",
    position: "לוחם ביחידה הרב ממדית",
    age: 20
  },
  {
    name: "סמ״ר יוגב אהרן",
    from: "פרדס חנה",
    position: "לוחם בגדוד 51",
    age: 20
  },
  {
    name: "רב״ט הלל שמואל סעדון",
    from: "ברקאי",
    position: "לוחם בסיירת נח״ל",
    description: "נהרג בקרב בקיבוץ סופה",
    age: 21
  },
  {
    name: "סרן הדר קמה",
    from: "גבעת שפירא",
    position: "קצין לוחם בסיירת מטכ״ל",
    age: 24
  },
  {
    name: "סמ״ר יונתן גולן",
    from: "יהוד-מונוסון",
    position: "מט״ק מרכבה בגדוד 77",
    age: 20
  },
  {
    name: "סמ״ר דוד רתנר",
    from: "אשדוד",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "רב״ט אופיר טסטה",
    from: "ירושלים",
    position: "טען מרכבה בגדוד 77",
    age: 21
  },
  {
    name: "סמל עמיחי יעקב ונינו",
    from: "קצרין",
    position: "מפקד כיתה במגלן",
    age: 22
  },
  {
    name: "רס״ן עידו ישראל שני",
    from: "רמת גן",
    position: "סגן מפקד סיירת הנח״ל",
    age: 29
  },
  {
    name: "סמ״ר מקס רבינוב",
    from: "אשדוד",
    position: "לוחם בגדוד איסוף 414",
    age: 21
  },
  {
    name: "סרן רז פרץ",
    from: "עפולה",
    position: "מפקד הפלס״ם בגדוד 51",
    age: 24
  },
  {
    name: "רב״ט שיר שלמה",
    from: "נתניה",
    position: "סמלת מבצעים בפיקוד העורף",
    age: 19
  },
  {
    name: "רב״ט אושר שמעיה",
    from: "באר שבע",
    position: "חייל במפקדת אוגדה 143",
    age: 19
  },
  {
    name: "סמ״ר יעד בן יעקב",
    from: "פתח תקווה",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "סמל בנימין לב",
    from: "ירושלים",
    position: "לוחם בגדוד 202",
    age: 23
  },
  {
    name: "רב״ט שיר ביטון",
    from: "אשדוד",
    position: "חובשת בחטיבה הצפונית",
    age: 19
  },
  {
    name: "סגן דקל סויסה",
    from: "בר גיורא",
    position: "מפקד מחלקה בגדוד 13",
    age: 23
  },
  {
    name: "סמ״ר דניאל משה דנינו",
    from: "חיפה",
    position: "לוחם בגדוד 13",
    age: 21
  },
  {
    name: "סמל יקיר לוי",
    from: "מורשת",
    position: "לוחם בגדוד 13",
    age: 21
  },
  {
    name: "טוראי עילי עזר",
    from: "שפיים",
    position: "חייל במפקדת אוגדה 143",
    age: 18
  },
  {
    name: "סמ״ר טל לוי",
    from: "ירושלים",
    position: "מפקד כיתה בגדוד 50",
    age: 21
  },
  {
    name: "סגן עדן נימרי",
    from: "מודיעין",
    position: "מפקדת צוות ברוכב שמיים, חיל התותחנים",
    age: 22
  },
  {
    name: "רב״ט ליאור עזיזוב",
    from: "כפר סילבר",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "רס״ל (במיל') תומר דולב",
    from: "אשקלון",
    position: "לוחם בגדוד בר",
    age: 34
  },
  {
    name: "סגן אלינה פרבוסודובה",
    from: "חיפה",
    position: "קצינה במחוז דרום, פיקוד העורף",
    age: 23
  },
  {
    name: "רס״ן רועי צ'אפל",
    from: "זכרון יעקב",
    position: "מפקד פלוגה בסיירת נח״ל",
    age: 25
  },
  {
    name: "סמל עידן רז",
    from: "עין המפרץ",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "רב״ט רועי פרי",
    from: "שוהם",
    position: "לוחם בגדוד 13",
    age: 19
  },
  {
    name: "סרן (מיל) מאיר דוד חיים",
    from: "ירושלים",
    position: "לוחם בסיירת מטכ״ל",
    description: "נהרג בקרב בקיבוץ בארי",
    age: 31
  },
  {
    name: "סמל אור מלכה",
    from: "עכו",
    position: "חייל במתפ״ש",
    age: 21
  },
  {
    name: "סמ״ר אלכסנדר מאסלי",
    from: "עפולה",
    position: "טכנאי נמ״ר בגדוד 601",
    age: 21
  },
  {
    name: "סתיו קמחי",
    from: "תלמי יוסף"
  },
  {
    name: "רודי סקריסבסקי",
    from: "מושב אוהד"
  },
  {
    name: "פקד אבי צידון",
    from: "מושב יבול",
    position: "סגן ראש משרד סיור בתחנת אופקים, מחוז דרום"
  },
  {
    name: "דודי תורגמן",
    from: "שדה ניצן"
  },
  {
    name: "אבי פליישר",
    from: "קיבוץ מגן"
  },
  {
    name: "דור נחום",
    from: "מושב מבטחים"
  },
  {
    name: "חן בן אבי",
    from: "מושב מבטחים"
  },
  {
    name: "רס״ר (במיל') דן אסולין",
    from: "מושב מבטחים",
    position: "רבש״צ המושב",
    age: 38
  },
  {
    name: "רס״ם (במיל') אביעד גד כהן",
    from: "שלומית",
    position: "חבר כיתת הכוננות ביישוב"
  },
  {
    name: "רס״ם (מיל') ראובן שישפורטיש",
    from: "שלומית",
    position: "חבר כיתת הכוננות ביישוב",
    age: 23
  },
  {
    name: "רס״ן (מיל') אופיר ארז",
    from: "סופה",
    position: "רבש״צ הקיבוץ",
    age: 57
  },
  {
    name: "ברנרד כהן",
    from: "סופה"
  },
  {
    name: "רס״ר (במיל) ירון ויקטור שחר",
    from: "ניר יצחק",
    position: "חברת כיתת הכוננות בקיבוץ",
    age: 51
  },
  {
    name: "סמ״ר (במיל׳) אופק ארזי",
    from: "ניר יצחק",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 28
  },
  {
    name: "שגיא זק",
    from: "כיסופים",
    age: 15
  },
  {
    name: "איתי זק",
    from: "כיסופים"
  },
  {
    name: "אתי זק",
    from: "כיסופים"
  },
  {
    name: "רס״ר (מיל׳) סער מרגוליס",
    from: "כיסופים",
    position: "חבר כיתת הכוננות בקיבוץ"
  },
  {
    name: "מנוחה חולתי",
    from: "כיסופים"
  },
  {
    name: "עופר רון",
    from: "כיסופים"
  },
  {
    name: "ג'ינה סמיאטיץ",
    from: "כיסופים"
  },
  {
    name: "תום גודו",
    from: "כיסופים"
  },
  {
    name: "ורדה הרמתי",
    from: "קיבוץ רעים"
  },
  {
    name: "אסף פבר",
    from: "קיבוץ רעים"
  },
  {
    name: "יובל גבאי",
    from: "קיבוץ רעים",
    age: 35
  },
  {
    name: "עמית גבאי",
    from: "קיבוץ רעים"
  },
  {
    name: "דביר קרפ",
    from: "קיבוץ רעים"
  },
  {
    name: "דרור בהט",
    from: "בית אלפא",
    description: "נרצח בקיבוץ רעים"
  },
  {
    name: "אליהו מיכאל הרוש",
    from: "נתיבות",
    position: "סייר בתחנת שדרות, מחוז דרום",
    age: 28
  },
  {
    name: "רס״ר אוריאל אברהם",
    position: "סייר ביס״מ נגב, מחוז דרום"
  },
  {
    name: "אוסמה אבו עסא",
    from: "תל שבע",
    position: "עבד כשומר",
    description: "נרצח בקיבוץ רעים",
    age: 36
  },
  {
    name: "מוסא אבו סבילה",
    from: "אבו תלול",
    position: "עבד כשומר",
    description: "נרצח בקיבוץ רעים",
    age: 41
  },
  {
    name: "ניר (ניקיטה) פופוב",
    from: "אשדוד",
    position: "מאבטח של שר התקשורת שלמה קרעי"
  },
  {
    name: "פקד אברהם הנקין",
    position: "לוחם ימ״מ"
  },
  {
    name: "טוראי יונתן אלעזרי",
    from: "אלון שבות",
    position: "לוחם בדובדבן",
    description: "נפל בקרב באופקים",
    age: 20
  },
  {
    name: "ידידיה רזיאל (רוזנברג)",
    from: "כרם שלום",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 31
  },
  {
    name: "עמיחי ישראל ויצן",
    from: "כרם שלום",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 33
  },
  {
    name: "נוה אלעזר לקס",
    from: "לוד",
    position: "לוחם בסיירת מטכ״ל",
    age: 21
  },
  {
    name: "סמ״ר טשגר טקה",
    from: "ירושלים",
    position: "חייל מנהלה בגדוד 51",
    age: 21
  },
  {
    name: "סג״ם יונתן גוטין",
    from: "מודיעין מכבים רעות",
    position: "קצין תקשוב ביחידה הרב ממדית",
    age: 20
  },
  {
    name: "סגן נתאי עמר",
    from: "עלומים",
    position: "ע' קצין הנדסה חטיבתי בחטמ״ר דרומית",
    age: 22
  },
  {
    name: "סמ״ר יוסף איתמר ברוכים",
    from: "אשדוד",
    position: "מ״כ בבא\"ח צנחנים",
    age: 20
  },
  {
    name: "סרן (מיל') רועי נגרי",
    from: "תל אביב",
    position: "מפק״צ בביה\"ס ללוט\"ר",
    age: 28
  },
  {
    name: "סמל ירון אורי שי",
    from: "קדימה צורן",
    position: "לוחם בסיירת נח״ל",
    age: 21
  },
  {
    name: "סמל בן רובינשטיין",
    from: "הוד השרון",
    position: "מדריך לוט״ר",
    age: 20
  },
  {
    name: "סגן איתי כהן",
    from: "רחובות",
    position: "מפק״צ ביהל\"ם",
    age: 22
  },
  {
    name: "רב״ט עילי בר שדה",
    from: "רמת גן",
    position: "לוחם בגדוד 13",
    age: 19
  },
  {
    name: "רב״ט עמית צור",
    from: "אליכין",
    position: "לוחם בגדוד 51",
    age: 19
  },
  {
    name: "רס״ן פלג סאלם",
    from: "מושב יכיני",
    position: "קצין לוגיסטיקה בחטיבה 460",
    age: 30
  },
  {
    name: "סמ״ר אוראל משה",
    from: "רכסים",
    position: "לוחם בגדוד 12 גולני",
    age: 21
  },
  {
    name: "רב״ט אדיר טהר",
    from: "ירושלים",
    position: "לוחם בגדוד 13",
    age: 19
  },
  {
    name: "סא״ל אלי גינסברג",
    from: "דברת",
    position: "קצין לוחם בשייטת 13, בתפקידו האחרון היה מפקד בי״ס לוט״ר",
    age: 42
  },
  {
    name: "טוראי ליאור לוי",
    from: "דימונה",
    position: "סמב״צית במחוז דרום של פיקוד העורף",
    age: 19
  },
  {
    name: "עבד אלרחמן עאטף אלזיאדנה",
    from: "רהט",
    age: 29
  },
  {
    name: "סיוון אלקבץ",
    from: "אשדוד"
  },
  {
    name: "תהילה קטאבי",
    from: "קיבוץ חולית"
  },
  {
    name: "פטרו בוסקו",
    from: "קיבוץ חולית"
  },
  {
    name: "משה רידלר",
    from: "קיבוץ חולית",
    age: 91
  },
  {
    name: "לילי קייסמן",
    from: "קיבוץ חולית"
  },
  {
    name: "רולאן סולטן",
    from: "קיבוץ חולית"
  },
  {
    name: "רונית סולטן",
    from: "קיבוץ חולית",
    position: "חברת הסגל האקדמי בתוכנית ללימודים רב תחומיים במכללת ספיר"
  },
  {
    name: "שלומי מתיאס",
    from: "קיבוץ חולית",
    position: "חבר הסגל האקדמי בתוכנית ללימודים רב תחומיים במכללת ספיר"
  },
  {
    name: "שחר מתיאס",
    from: "קיבוץ חולית"
  },
  {
    name: "רס״ל (מיל') חיים ישורון כצמן",
    from: "חולית",
    age: 32
  },
  {
    name: "מאיר אלחרר",
    from: "קיבוץ חולית"
  },
  {
    name: "ליז חלפון אלחרר",
    from: "קיבוץ חולית"
  },
  {
    name: "רב״ט עמית גואטה",
    from: "רחובות",
    position: "לוחם ביחידת מגלן",
    age: 21
  },
  {
    name: "סמ״ר אור מזרחי",
    from: "פתח תקווה",
    position: "לוחם בסיירת נח״ל",
    age: 21
  },
  {
    name: "רב״ט דנית כהן",
    from: "שדרות",
    position: "סמב״צית במפקדת מחוז דרום",
    age: 19
  },
  {
    name: "רס״ן אריאל בן משה",
    from: "קריית ביאליק",
    position: "מפקד פלוגה בסיירת מטכ״ל",
    age: 27
  },
  {
    name: "רס״ב עידו רוזנטל",
    from: "בן שמן",
    position: "לוחם שלדג",
    age: 45
  },
  {
    name: "רס״ן אמיר סקורי",
    from: "ירושלים",
    position: "לוחם בסיירת מטכ״ל",
    age: 31
  },
  {
    name: "סגן שילה כהן",
    from: "שדרות",
    position: "לוחם בשלדג",
    age: 24
  },
  {
    name: "רס״ם אהרון פרש",
    from: "אופקים",
    position: "בוחן צ״י בטנ״א מחוז דרום",
    age: 36
  },
  {
    name: "רב״ט שירה שוחט",
    from: "מודיעין מכבים רעות",
    position: "תצפיתנית בגדוד איסוף 414",
    age: 19
  },
  {
    name: "סמ״ר גיא שמחי",
    from: "גדרה",
    position: "לוחם בסיירת צנחנים",
    age: 20
  },
  {
    name: "רב״ט אריאל אליהו",
    from: "מצפה יריחו",
    position: "לוחם בגדוד 77 חטיבה 7",
    age: 19
  },
  {
    name: "סמ״ר אדיר גאורי",
    from: "ירושלים",
    position: "לוחם בסיירת מטכ״ל",
    age: 20
  },
  {
    name: "סמ״ר רועי וויזר",
    from: "אפרת",
    position: "לוחם בגדוד 13",
    age: 21
  },
  {
    name: "עילי נחמן",
    from: "אבן יהודה",
    description: "נהרג בפשיטת המחבלים על מתחם הבילוי בסמוך לרעים",
    age: 23
  },
  {
    name: "מאור שלום",
    from: "מושב ערוגות",
    description: "נהרג מאש מחבלים",
    age: 46
  },
  {
    name: "יוסף (יוסי) טהר",
    from: "ביצרון",
    description: "נהרג מאש מחבלים",
    age: 39
  },
  {
    name: "רס״מ דבורה אברהם",
    position: "סיירת בתחנת אופקים"
  },
  {
    name: "רס״ב דניס בלקין",
    from: "אופקים",
    position: "סייר עירוני בתחנת שדרות",
    age: 47
  },
  {
    name: "פקד סטס שיינקמן",
    position: "קצין טרור בלתי קובנציונאלי בימ״מ"
  },
  {
    name: "רפ״ק ודים בליך",
    position: "מפקד פלגה במנהלת תיאום פעולות אכיפה (מתפ״א)"
  },
  {
    name: "חאלד אלפראחין",
    from: "ערערה",
    description: "נרצח ברעים"
  },
  {
    name: "אוסמה אבו מדיעם",
    from: "רהט",
    description: "ככל הנראה נורה למוות במושב מבטחים",
    age: 28
  },
  {
    name: "רב״ט ירון זהר",
    from: "קריית אתא",
    position: "לוחם בגדוד 13",
    age: 19
  },
  {
    name: "סגן רום שלומי",
    from: "מושב גנות",
    position: "לוחם ביחידת שלדג",
    age: 23
  },
  {
    name: "סגן איתי מאור",
    from: "ראש העין",
    position: "מפקד מחלקה בגדוד 51",
    age: 23
  },
  {
    name: "סגן שוהם תומר",
    from: "שריגים",
    position: "מפקד מחלקה בסיירת נח״ל",
    age: 23
  },
  {
    name: "רס״ל ויטלי סקיפקביץ׳",
    from: "אריאל",
    position: "לוחם ביחידת אגוז",
    age: 21
  },
  {
    name: "רס״ן (מיל׳) עמרי מיכאלי",
    from: "נס ציונה",
    position: "לוחם ביחידת דובדבן",
    age: 35
  },
  {
    name: "רב״ט אורי לוקר",
    from: "פרדס חנה כרכור",
    position: "לוחם בגדוד 51",
    age: 19
  },
  {
    name: "רס״ן עידו יהושע",
    from: "יבנה",
    position: "מפקד פלגת ההדרכה בבית הספר לכוחות אוויר מיוחדים",
    age: 27
  },
  {
    name: "רב״ט איתמר עיש",
    from: "קריית גת",
    position: "שירת במחוז דרום של פיקוד העורף",
    age: 19
  },
  {
    name: "סמ״ר אהד כהן",
    from: "עידן",
    position: "מ״מ סיור ביחידת שלדג",
    age: 20
  },
  {
    name: "סמ״ר אילי גמזו",
    from: "אשדוד",
    position: "מפקד כיתה בבא״ח צנחנים",
    age: 20
  },
  {
    name: "סרן אריה שלמה צירינג",
    from: "רעננה",
    position: "מ״פ תקיפה ביחידת עוקץ",
    age: 27
  },
  {
    name: "סרן טל גרושקה",
    from: "כפר סבא",
    position: "מפקד פלוגה בגדוד 931 בחטיבת הנח״ל",
    age: 25
  },
  {
    name: "טוראית אופיר דוידיאן",
    from: "פטיש",
    position: "שירתה בלוגיסטיקה פקע״ר",
    age: 18
  },
  {
    name: "סמל איתי-אל מרציאנו",
    from: "שוהם",
    position: "מפקד כיתה בבא״ח צנחנים",
    age: 20
  },
  {
    name: "רס״ן אברהם חובלאשוילי",
    from: "אשדוד",
    position: "קצין בקרקל",
    age: 26
  },
  {
    name: "סא״ל יהונתן צור",
    from: "קדומים",
    position: "מג״ד סיירת נח״ל",
    age: 33
  },
  {
    name: "אל״ם רועי יוסף לוי",
    from: "שבי ציון",
    position: "מפקד היחידה הרב מימדית",
    age: 44
  },
  {
    name: "עבד א-רחמאן א-נסאסרה",
    from: "כסייפה",
    description: "נורה למוות בקיבוץ רעים",
    age: null
  },
  {
    name: "רב שוטר רווית חנה אסייג",
    from: "אשדוד",
    position: "לוחמת היחידה לבט״פ במג\"ב דרום",
    age: 19
  },
  {
    name: "סמל ראשון אליונה אסטפנקו",
    position: "סיירת בתחנת אופקים, מחוז דרום",
    age: 25
  },
  {
    name: "רב סמל שי אל קנפו",
    position: "סייר בתחנת עיירות, מחוז דרום",
    age: 30
  },
  {
    name: "רב סמל מיכאל ליזמי",
    position: "בלש בתחנת באר שבע, מחוז דרום",
    age: 28
  },
  {
    name: "רב סמל אבי בוזגלו",
    position: "בלש בתחנת רהט, מחוז דרום",
    age: 26
  },
  {
    name: "רב סמל ראשון אליאור יפרח",
    position: "בלש יחידה מרכזית (ימ״ר)‎ נגב, מחוז דרום",
    age: 34
  },
  {
    name: "רב סמל ראשון שלמה יעקב קרסנינסקי",
    position: "לוחם ביחידת המסתערבים מג״ב דרום",
    age: 23
  },
  {
    name: "רב סמל ראשון דרור אלטון",
    position: "חבלן ביחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 29
  },
  {
    name: "רב סמל מתקדם יוראי אליהו כהן",
    position: "לוחם היחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 29
  },
  {
    name: "רב סמל מתקדם מליק קרים",
    position: "חוקר בתחנת באר שבע, מחוז דרום",
    age: 32
  },
  {
    name: "רב סמל מתקדם אליק פוזניאקוב",
    from: "אשקלון",
    position: "בלש ביחידת מגן, מחוז דרום",
    age: 38
  },
  {
    name: "רב סמל מתקדם ויטלי קרסי",
    from: "אשקלון",
    position: "חוקר זירה מחלקת זיהוי פלילי (מז״פ) מחוז תל אביב",
    age: 38
  },
  {
    name: "רב סמל מתקדם אלכסי בודובסקי",
    position: "סייר יס״מ נגב, מחוז דרום",
    age: 39
  },
  {
    name: "רב סמל מתקדם אלון ברד",
    from: "באר שבע",
    position: "חוקר בתחנת רהט, מחוז דרום",
    age: 38
  },
  {
    name: "רב סמל מתקדם בר סיוון",
    from: "כוכב יאיר",
    position: "לוחם ביחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 33
  },
  {
    name: "רב סמל בכיר יגאל אילוז",
    from: "אופקים",
    position: "חבלן מחוז דרום",
    description: "נפל בקרב באופקים",
    age: 56
  },
  {
    name: "רב סמל בכיר אדיר שלמה",
    position: "ראש מטה לוגיסטי בתחנת שדרות, מחוז דרום",
    age: 47
  },
  {
    name: "רב סמל בכיר רוני אבוהרון",
    position: "בלש בתחנת רהט, מחוז דרום",
    age: 39
  },
  {
    name: "רב סמל בכיר יהודה קאדר",
    from: "עין הבשור",
    position: "מש״ק אשכול עין הבשור מג\"ב דרום",
    age: 50
  },
  {
    name: "רב סמל בכיר רומן גנדל",
    from: "לוד",
    position: "מדריך לוט״ר, חטיבה טקטית מג\"ב",
    age: 47
  },
  {
    name: "רב סמל בכיר חן נחמיאס",
    position: "צלף ביחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 43
  },
  {
    name: "רב נגד מאיר אברג'ל",
    position: "רכז חקירות תחנת שדרות, מחוז דרום",
    age: 55
  },
  {
    name: "מפקח אלכסיי שמקלוב",
    position: "קצין ביחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 34
  },
  {
    name: "מפקח אנדריי פושיבאי",
    from: "באר שבע",
    position: "קצין סיור תחנת עיירות יחידת יואב, מחוז דרום",
    age: 39
  },
  {
    name: "רב פקד אמין אוחונדוב",
    from: "אופקים",
    position: "מפקד צוות ביחידת יואב, מחוז דרום",
    age: 36
  },
  {
    name: "פקד ניסים לוגסי",
    position: "סגן מפקד יחידת תקיפה כפרית מג״ב דרום",
    age: 30
  },
  {
    name: "פקד משה אל שלמה",
    position: "קצין ביחידה המיוחדת ללוחמה בטרור (ימ״מ)",
    age: 33
  },
  {
    name: "רב פקד מרטין קוזמיצקס",
    position: "מ' פלגה במנהלת תיאום פעולות אכיפה (מתפ״א)",
    age: 47
  },
  {
    name: "סגן ניצב יצחק בזוקה שווילי",
    position: "מפקד תחנת שגב שלום, מחוז דרום",
    age: 44
  },
  {
    name: "סגן ניצב ג'יי אר דוידוב",
    position: "מפקד תחנת רהט, מחוז דרום",
    age: 44
  },
  {
    name: "אריק יהודה מרציאנו",
    position: "מפקד צוות בתחנת כיבוי קרית גת",
    age: 50
  },
  {
    name: "סגן (מיל') עידו אדרי",
    from: "גיבתון",
    position: "קצין בחיל הרגלים/איש שב״כ",
    age: 24
  },
  {
    name: "רס״ל אמיר פישר",
    from: "תל אביב",
    position: "לוחם בדובדבן",
    age: 22
  },
  {
    name: "רב״ט עדי גרומן",
    from: "חוגלה",
    position: "לוחמת איסוף בגדוד 414",
    age: 19
  },
  {
    name: "סרן אור יוסף רן",
    from: "איתמר",
    position: "מפקד צוות בדובדבן",
    age: 29
  },
  {
    name: "רב״ט נתנאל יאנג",
    from: "תל אביב",
    position: "לוחם בגדוד 13",
    age: 20
  },
  {
    name: "סגן משנה יואב מלייב",
    from: "קריית אונו",
    position: "קצין קשר גדודי בגדוד 77",
    age: 19
  },
  {
    name: "סמ״ר עידו הרוש",
    from: "מצפה רמון",
    position: "לוחם בגדוד 77",
    age: 21
  },
  {
    name: "סגן יפתח יעבץ",
    from: "רמת השרון",
    position: "קצין במגלן",
    age: 23
  },
  {
    name: "טוראי נעמה בוני",
    from: "עפולה",
    position: "מש״קית ת\"ש בגדוד 77",
    age: 19
  },
  {
    name: "טוראי נריה אהרון נגרי",
    from: "טלמון",
    position: "לוחם חילוץ והצלה בבא״ח העורף",
    age: 18
  },
  {
    name: "רב״ט גיא בזק",
    from: "כוכב יאיר",
    position: "לוחם בגדוד 51",
    age: 19
  },
  {
    name: "סמ״ר יובל בן יעקב",
    from: "כפר מנחם",
    position: "לוחם בגדוד 77",
    age: 21
  },
  {
    name: "סמל עדן אלון לוי",
    from: "נירית",
    position: "מ״כית בבא\"ח העורף",
    age: 19
  },
  {
    name: "רב״ט דביר לישה",
    from: "ניצן",
    position: "לוחם בגדוד 51",
    age: 21
  },
  {
    name: "סמ״ר עומרי ניב פיירשטיין",
    from: "גבעתיים",
    position: "לוחם חילוץ והצלה בבא״ח העורף",
    age: 20
  },
  {
    name: "סגן אור מוזס",
    from: "אשדוד",
    position: "סמ״פ בבא\"ח העורף",
    description: "נהרגה בבסיס זיקים",
    age: 22
  },
  {
    name: "סג״ם ינאי קמינקא",
    from: "צור הדסה",
    position: "מ״מ בבא\"ח העורף",
    age: 20
  },
  {
    name: "סמל אפיק רוזנטל",
    from: "כפר מנחם",
    position: "לוחם במגלן",
    age: 20
  },
  {
    name: "סא״ל סהר מחלוף",
    from: "מודיעין",
    position: "מג״ד תקשוב 481",
    age: 36
  },
  {
    name: "סמל אור אסתו",
    from: "באר שבע",
    position: "נגד לוגיסטיקה בגדוד 51",
    age: 21
  },
  {
    name: "סג״ם אדר בן סימון",
    from: "נווה זיו",
    position: "מ״מ בבא\"ח העורף",
    age: 20
  },
  {
    name: "סמ״ר אופיר ציוני",
    from: "יקנעם עילית",
    position: "מ״כ בגדוד 51",
    age: 21
  },
  {
    name: "סרן יותם בן בסט",
    from: "בת חפר",
    position: "מפק״ץ ביחידה הרב מימדית",
    age: 24
  },
  {
    name: "סרן אדיר עבודי",
    from: "מודיעין",
    position: "מ״פ בבא\"ח העורף",
    age: 23
  },
  {
    name: "רס״ן חן בוכריס",
    from: "אשדוד",
    position: "סגן מפקד יחידת מגלן",
    description: "נהרג בהיתקלות עם מחבלים",
    age: 26
  },
  {
    name: "אהרון חיימוב",
    from: "אופקים",
    position: "חובש בכיר במד״א",
    description: "נורה למוות באופקים כשנהג באמבולנס בדרכו לטפל בפצועים",
    age: 25
  },
  {
    name: "מרסל טליה",
    from: "קריית ארבע",
    description: "נרצחה בעין השלושה"
  },
  {
    name: "חנה בן ארצי",
    from: "כפר אביב",
    description: "נהרגה מפגיעת רקטה, כשהיתה בדרכה לפתוח מקלט עבור תושבים שאין להם ממ\"ד",
    age: 69
  },
  {
    name: "רב כבאי יבגני גלסקי",
    from: "שדרות",
    description: "נהרג בשדרות",
    age: 34
  },
  {
    name: "רב רשף שלום צאבן",
    from: "שדרות",
    position: "מפקד התחנה המרחבית לכיבוי והצלה קריית גת",
    age: 60
  },
  {
    name: "דני וובק",
    from: "נתיב העשרה"
  },
  {
    name: "מרינה אלמגור",
    from: "נתיב העשרה",
    age: 76
  },
  {
    name: "נורית ברגר",
    from: "נתיב העשרה"
  },
  {
    name: "אור אקוני",
    from: "נתיב העשרה"
  },
  {
    name: "אריה אקוני",
    from: "נתיב העשרה"
  },
  {
    name: "רותי אקוני",
    from: "נתיב העשרה"
  },
  {
    name: "טל קרן",
    from: "נתיב העשרה",
    age: 17
  },
  {
    name: "סרן (במיל') עדי בהרב רבינוביץ'",
    from: "נתיב העשרה",
    position: "חבר כיתת הכוננות בקיבוץ",
    age: 62
  },
  {
    name: "אור תעסה",
    from: "נתיב העשרה",
    age: 16
  },
  {
    name: "דקלה ערבה",
    from: "נחל עוז"
  },
  {
    name: "חויק סגל",
    from: "נתיב העשרה"
  },
  {
    name: "איילת מולכו",
    from: "נתיב העשרה"
  },
  {
    name: "שלומי מולכו",
    from: "נתיב העשרה"
  },
  {
    name: "אורן שטרן",
    from: "נתיב העשרה",
    description: "חבר כיתת הכוננות בקיבוץ"
  },
  {
    name: "יגאל וקס",
    from: "נתיב העשרה"
  },
  {
    name: "רס״ב (מיל׳) עמית וקס",
    from: "נתיב העשרה",
    description: "חבר כיתת הכוננות ביישוב",
    age: 48
  },
  {
    name: "דליה אבו מדיעם",
    from: "רהט",
    description: "נהרגה בעוטף עזה"
  },
  {
    name: "מאי זוהיר אבו סבייח",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 13
  },
  {
    name: "פאיזה אבו סבייח",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 57
  },
  {
    name: "פאטמה אלטלאקת",
    from: "ערערה",
    description: "נהרגה מירי ליד אופקים",
    age: 35
  },
  {
    name: "מחמד ד'יב אלקרעאן",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 12
  },
  {
    name: "אמין עקל אלקרעאן",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 11
  },
  {
    name: "ג'וועד אברהים אלקרעאן",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 15
  },
  {
    name: "מאלק אברהים אלקרעאן",
    from: "כוחלה",
    description: "פגיעה ישירה של רקטה בצריף מגורים בכוחלה",
    age: 14
  },
  {
    name: "יזן זכריה אבו ג'מאע",
    from: "ערערה",
    description: "מת מפגיעת רקטה ליד ביתו בערערה",
    age: 5
  },
  {
    name: "אופיר ליבשטיין",
    from: "כפר עזה",
    position: "ראש המועצה האזורית שער הנגב",
    description: "נהרג בחילופי אש עם מחבלים בכפר עזה",
    age: 50
  },
  {
    name: "אל״מ יהונתן שטיינברג",
    from: "שומריה",
    position: "מפקד חטיבת הנח״ל",
    description: "נהרג בהיתקלות עם מחבלים בכרם שלום",
    age: 43
  }
];

// sort randomly
victimList.sort(() => Math.random() - 0.5);

// sort by age
// victimList.sort((a, b) => {
//   if (a.age && b.age) {
//     return a.age - b.age;
//   } else if (a.age) {
//     return -1;
//   } else if (b.age) {
//     return 1;
//   } else {
//     return 0;
//   }
// });

// Phone number to send the message to (include the country code)
let politicianPhone = "+972526163059";
let startText = `אדוני שר התקשורת, קח אחריות על:`;
let politicianGender = "male";

const victimsDiv = document.getElementById("victims");
victimList.forEach(victim => {
  const victimDiv = document.createElement("div");
  victimDiv.className = "victim";
  const victimTextsDiv = document.createElement("div");
  victimTextsDiv.className = "victim-texts";

  const nameH3 = document.createElement("h3");
  const candleImage = document.createElement("img");
  candleImage.src = "./candle.jpeg";
  candleImage.alt = "Candle image";

  const nameSpan = document.createElement("span");
  nameSpan.textContent = `${victim.name} ז״ל`;
  nameH3.appendChild(candleImage);
  nameH3.appendChild(nameSpan);
  nameH3.className = "name";
  victimTextsDiv.appendChild(nameH3);

  const ageFromDiv = document.createElement("div");
  ageFromDiv.textContent = `${victim.age ? `גיל: ${victim.age}` : ""}${victim.age && victim.from ? `, ` : ""}${victim.from ? `${victim.from}` : ""}`;
  ageFromDiv.className = "from";
  victimTextsDiv.appendChild(ageFromDiv);

  if (victim.position) {
    const positionDiv = document.createElement("div");
    positionDiv.textContent = victim.position;
    positionDiv.className = "position";
    victimTextsDiv.appendChild(positionDiv);
  }

  if (victim.description) {
    const descriptionDiv = document.createElement("div");
    descriptionDiv.textContent = victim.description;
    descriptionDiv.className = "description";
    victimTextsDiv.appendChild(descriptionDiv);
  }
  victimDiv.appendChild(victimTextsDiv);

  const sendDiv = document.createElement("div");
  const img = document.createElement("img");
  img.src = "./whatsapp.svg";
  img.alt = "Whatsapp logo image";

  const span = document.createElement("span");
  span.textContent = "שליחה לשר/ה";
  sendDiv.appendChild(img);
  sendDiv.appendChild(span);
  sendDiv.className = "send-div";

  victimDiv.appendChild(sendDiv);
  victimDiv.addEventListener("click", () => {
    handleClick(victim);
  });
  victimsDiv.appendChild(victimDiv);
});


function handleClick(victim) {
  gtag('event', 'button_click', {
    'event_category': 'accountable2023',
    'event_label': 'send_to_karhi__button_click'
  });

  // Message content
  const name = `\n*${victim.name}* ז״ל`;
  const ageFrom = `${victim.age || victim.from ? `\n` : ""}${victim.age ? `גיל: ${victim.age}` : ""}${victim.age && victim.from ? `, ` : ""}${victim.from ? `${victim.from}` : ""}`
  const position = victim.position ? `\n${victim.position}` : "";
  const description = victim.description ? `\n${victim.description}` : "";
  const endText = `\n\n${politicianGender == "male" ? `התנצל ` : `התנצלי `}על כישלון הממשלה להיערך ולמנוע את הטבח, ועל כישלון הממשלה לדאוג לניצולים מאז הטבח ועד היום.`;

  // Create a formatted message
  const message = `${startText}${name}${ageFrom}${position}${description}${endText}`;

  // Encode the message for a WhatsApp URL
  const encodedMessage = encodeURIComponent(message);

  // WhatsApp URL
  const whatsappUrl = `https://api.whatsapp.com/send?phone=${politicianPhone}&text=${encodedMessage}`;
  // Testing
  // const whatsappUrl = `https://api.whatsapp.com/send?text=${encodedMessage}`;

  // Open the WhatsApp link in a new tab
  window.open(whatsappUrl, "_blank");
}

const choosePolitician = document.getElementById("choose-politician");

choosePolitician.addEventListener("click", () => {
  // Create popup element
  const popup = document.createElement("div");
  popup.className = "popup";

  // Create header element
  const header = document.createElement("header");
  header.className = "popup-header";

  // Create title element
  const title = document.createElement("h2");
  title.textContent = "בחירת שר/ה";

  // Create close button element
  const closeButton = document.createElement("button");
  closeButton.className = "popup-close-button";
  closeButton.textContent = "✕";
  closeButton.addEventListener("click", () => {
    document.body.removeChild(popup);
  });

  // Append title and close button to header
  header.appendChild(title);
  header.appendChild(closeButton);


  // Politician list
  const politicians = [
    { fullName: 'שלמה קרעי', title: 'שר התקשורת', lastName: 'השר קרעי', party: 'ליכוד', phone: '+972526163059', startText: 'אדוני שר התקשורת, קח אחריות על:', gender: 'male' },
    { fullName: 'יריב לוין', title: 'שר המשפטים', lastName: 'השר לוין', party: 'ליכוד', phone: '+972522769183', startText: 'אדוני שר המשפטים, קח אחריות על:', gender: 'male' },
    { fullName: 'יואב גלנט', title: 'שר הבטחון', lastName: 'השר גלנט', party: 'ליכוד', phone: '+972546100100', startText: 'אדוני שר הבטחון, קח אחריות על:', gender: 'male' },
    { fullName: 'אלי כהן', title: 'שר החוץ', lastName: 'השר כהן', party: 'ליכוד', phone: '+972507500600', startText: 'אדוני שר החוץ, קח אחריות על:', gender: 'male' },
    { fullName: 'דוד אמסלם', title: 'השר המקשר לכנסת', lastName: 'השר אמסלם', party: 'ליכוד', phone: '+972537769651', startText: 'אדוני השר המקשר לכנסת, קח אחריות על:', gender: 'male' },
    { fullName: 'אמיר אוחנה', title: 'יושב ראש הכנסת', lastName: 'יושב ראש הכנסת אוחנה', party: 'ליכוד', phone: '+972547484840', startText: 'אדוני יושב ראש הכנסת, קח אחריות על:', gender: 'male' },
    { fullName: 'יואב קיש', title: 'שר החינוך', lastName: 'השר קיש', party: 'ליכוד', phone: '+972542523333', startText: 'אדוני שר החינוך, קח אחריות על:', gender: 'male' },
    { fullName: 'ניר ברקת', title: 'שר הכלכלה', lastName: 'השר ברקת', party: 'ליכוד', phone: '+972506908888', startText: 'אדוני שר הכלכלה, קח אחריות על:', gender: 'male' },
    { fullName: 'מירי רגב', title: 'שרת התחבורה', lastName: 'השרה רגב', party: 'ליכוד', phone: '+972506202600', startText: 'גברתי שרת התחבורה, קחי אחריות על:', gender: 'female' },
    { fullName: 'מיקי זוהר', title: 'שר התרבות', lastName: 'השר זוהר', party: 'ליכוד', phone: '+972525858668', startText: 'אדוני שר התרבות, קח אחריות על:', gender: 'male' },
    { fullName: 'אבי דיכטר', title: 'שר החקלאות', lastName: 'השר דיכטר', party: 'ליכוד', phone: '+972507558899', startText: 'אדוני שר החקלאות, קח אחריות על:', gender: 'male' },
    { fullName: 'ישראל כץ', title: 'שר התשתיות', lastName: '	השר כץ', party: 'ליכוד', phone: '+972506233939', startText: 'אדוני שר התשתיות , קח אחריות על:', gender: 'male' },
    { fullName: 'עמיחי שיקלי', title: 'שר התפוצות', lastName: 'השר שיקלי', party: 'ליכוד', phone: '+972526027800', startText: 'אדוני שר התפוצות, קח אחריות על:', gender: 'male' },
    { fullName: 'עידית סילמן', title: 'השרה להגנת הסביבה', lastName: 'השרה סילמן', party: 'ליכוד', phone: '+972549987074', startText: 'גברתי השרה להגנת הסביבה, קחי אחריות על:', gender: 'female' },
    { fullName: 'חיים כץ', title: 'שר התיירות', lastName: 'השר כץ', party: 'ליכוד', phone: '+972523274333', startText: 'אדוני שר התיירות, קח אחריות על:', gender: 'male' },
    { fullName: 'גילה גמליאל', title: 'שרת המודיעין', lastName: 'השרה גמליאל', party: 'ליכוד', phone: '+972506200039', startText: 'גברתי שרת המודיעין, קחי אחריות על:', gender: 'female' },
    { fullName: 'מאי גולן', title: 'השרה למעמד האשה', lastName: 'השרה גולן', party: 'ליכוד', phone: '+972544461414', startText: 'גברתי השרה למעמד האשה, קחי אחריות על:', gender: 'female' },
    {
      fullName: "בצלאל סמוטריץ'",
      title: "שר האוצר",
      lastName: "השר סמוטריץ'",
      party: "הציונות הדתית",
      phone: "+972528903771",
      startText: "אדוני שר האוצר, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "איתמר בן גביר",
      title: "השר לבטחון לאומי",
      lastName: "השר בן גביר",
      party: "הציונות הדתית",
      phone: "+972528693867",
      startText: "אדוני השר לבטחון לאומי, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "אורית סטרוק",
      title: "שרה למשימות לאומיות",
      lastName: "השרה סטרוק",
      party: "הציונות הדתית",
      phone: "+972524295558",
      startText: "גברתי השרה למשימות לאומיות, קחי אחריות על:",
      gender: "female"
    },
    {
      fullName: "יצחק וסרלאוף",
      title: "שר הנגב והגליל",
      lastName: "השר וסרלאוף",
      party: "הציונות הדתית",
      phone: "+972545852404",
      startText: "אדוני שר הנגב והגליל, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "עמיחי אליהו",
      title: "שר המורשת",
      lastName: "השר אליהו",
      party: "הציונות הדתית",
      phone: "+972527203113",
      startText: "אדוני שר המורשת, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "אריה דרעי",
      title: "יו״ר ש״ס",
      lastName: "יו״ר ש״ס דרעי",
      party: "שס",
      phone: "+972545500500",
      startText: "אדוני יו״ר ש״ס, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "יעקב מרגי",
      title: "שר הרווחה",
      lastName: "השר מרגי",
      party: "שס",
      phone: "+972504963737",
      startText: "אדוני שר הרווחה, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "יואב בן צור",
      title: "שר העבודה",
      lastName: "השר בן צור",
      party: "שס",
      phone: "+972502222861",
      startText: "אדוני שר העבודה, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "מיכאל מלכיאלי",
      title: "השר לשירותי דת",
      lastName: "השר מלכיאלי",
      party: "שס",
      phone: "+972542040502",
      startText: "אדוני השר לשירותי דת, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "חיים ביטון",
      title: "שר החינוך החרדי",
      lastName: "השר ביטון",
      party: "שס",
      phone: "+972525990000",
      startText: "אדוני שר החינוך החרדי, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "משה ארבל",
      title: "שר הבריאות והפנים",
      lastName: "השר ארבל",
      party: "שס",
      phone: "+972506496621",
      startText: "אדוני שר הבריאות והפנים, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "יצחק גולדקנופף",
      title: "שר השיכון",
      lastName: "השר גולדקנופף",
      party: "יהדות התורה",
      phone: "+972527644550",
      startText: "אדוני שר השיכון, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "משה גפני",
      title: "יו״ר דגל התורה",
      lastName: "יו״ר דגל התורה גפני",
      party: "יהדות התורה",
      phone: "+972504141411",
      startText: "אדוני יו״ר דגל התורה, קח אחריות על:",
      gender: "male"
    },
    {
      fullName: "מאיר פרוש",
      title: "שר ירושלים",
      lastName: "השר פרוש",
      party: "יהדות התורה",
      phone: "+972505405300",
      startText: "אדוני שר ירושלים, קח אחריות על:",
      gender: "male"
    }

  ];


  // Create list element
  const politicianList = document.createElement("div");
  politicianList.className = "politician-list";

  // Create list items and add click event listeners
  politicians.forEach(politician => {
    const listItem = document.createElement("div");
    const party = getParty(politician.party);
    listItem.className = "politician-item" + party;

    listItem.textContent = `${politician.fullName} - ${politician.title} - ${politician.party}`;
    listItem.addEventListener("click", () => {
      const politicianNameTitle = document.querySelector(".politician-name-title");
      politicianNameTitle.textContent = politician.lastName;
      politicianPhone = politician.phone;
      startText = politician.startText;
      politicianGender = politician.gender;
      const takeResponsibilityTitle = document.getElementById("take-responsibility-title");
      takeResponsibilityTitle.textContent = politician.gender == "male" ? "קח אחריות" : "קחי אחריות";

      document.body.removeChild(popup);
    });
    politicianList.appendChild(listItem);
  });

  // Append header and list to popup
  popup.appendChild(header);
  popup.appendChild(politicianList);

  // Append popup to body
  document.body.appendChild(popup);
});


const link = document.querySelector('.send-message-cta');

link.addEventListener("click", (event) => {
  event.preventDefault();
  victimsDiv.scrollIntoView({
    behavior: "smooth"
  });
});


function getParty(partyHeb) {
  switch (partyHeb) {
    case "הליכוד":
      return " likud";
    case "הציונות הדתית":
      return " religious-zionism";
    case "שס":
      return " shas";
    case "יהדות התורה":
      return " yahadut-hatorah";
    default:
      return "";
  }
}


/*
יצחק וסרלאוף
גילה גמליאל
מיכאל מלכיאלי
אופיר אקוניס
יריב לוין
יואב גלנט
אריה דרעי
מירי רגב
בצלאל סמוטריץ'
חיים כץ
השרים ניר ברקת
אופיר סופר
עידית סילמן
אלי כהן
איתמר בן גביר
אורית סטרוק
יואב קיש
עמיחי אליהו
גלית דיסטל-אטבריאן
אבי דיכטר
חיים ביטון
ישראל כ"ץ
רון דרמר
יעקב מרגי
יצחק גולדקנופף
מיקי זוהר
שלמה קרעי
יואב בן צור 
עמיחי שיקלי
*/
